; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v6 ?v3)
             (pred_10 ?v5 ?v7)
             (pred_5 ?v6 ?v7)
             (pred_11 ?v11 ?v6 )
	     (pred_9 ?v6)
             (pred_2 ?v4)
             (pred_3 ?v5)
             (pred_1 ?v7)
             (pred_12 ?v6)
             (pred_4 ?v5)
             (pred_8 ?v6)
             (pred_6 ))



(:action op_4
:parameters (?v13 ?v8 ?v9 ?v1)
:precondition (and (pred_2 ?v13) (pred_2 ?v8) (pred_3 ?v9) (pred_1 ?v1)
          (pred_7 ?v13 ?v8) (pred_10 ?v9 ?v1)
                   (pred_5 ?v8 ?v1) (pred_9 ?v13) 
                   (pred_12 ?v8) (pred_4 ?v9))
:effect (and  (pred_8 ?v8) (not (pred_12 ?v8))))


(:action op_3
:parameters (?v13 ?v12)
:precondition (and (pred_2 ?v13) (pred_2 ?v12)
               (pred_9 ?v13) (pred_7 ?v13 ?v12) (pred_8 ?v12))
:effect (and (pred_9 ?v12) (not (pred_9 ?v13))))

(:action op_5
:parameters (?v13 ?v9)
:precondition (and (pred_2 ?v13) (pred_3 ?v9) 
                  (pred_9 ?v13) (pred_11 ?v9 ?v13) (pred_6 ))
:effect (and (pred_4 ?v9)
   (not (pred_11 ?v9 ?v13)) (not (pred_6 ))))


(:action op_2
:parameters (?v13 ?v10 ?v2)
:precondition (and (pred_2 ?v13) (pred_3 ?v10) (pred_3 ?v2)
                  (pred_9 ?v13) (pred_4 ?v2) (pred_11 ?v10 ?v13))
:effect (and (pred_4 ?v10) (pred_11 ?v2 ?v13)
        (not (pred_4 ?v2)) (not (pred_11 ?v10 ?v13))))

(:action op_1
:parameters (?v13 ?v9)
:precondition (and (pred_2 ?v13) (pred_3 ?v9) 
                  (pred_9 ?v13) (pred_4 ?v9))
:effect (and (pred_6 ) (pred_11 ?v9 ?v13) (not (pred_4 ?v9)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_06 obj_02 obj_09 obj_15 obj_05 obj_01 obj_19 obj_18 obj_12 obj_07 obj_17 obj_04 obj_21 obj_10 obj_16 obj_08
    obj_11 obj_20
    obj_14 obj_13 obj_03
    )

    (:init
       (pred_6)

       (pred_2 obj_06)
       (pred_2 obj_02)
       (pred_2 obj_09)
       (pred_2 obj_15)
       (pred_2 obj_05)
       (pred_2 obj_01)
       (pred_2 obj_19)
       (pred_2 obj_18)
       (pred_2 obj_12)
       (pred_2 obj_07)
       (pred_2 obj_17)
       (pred_2 obj_04)
       (pred_2 obj_21)
       (pred_2 obj_10)
       (pred_2 obj_16)
       (pred_2 obj_08)
       (pred_1 obj_11)
       (pred_1 obj_20)
       (pred_3 obj_14)
       (pred_3 obj_13)
       (pred_3 obj_03)

       (pred_7 obj_06 obj_05)
       (pred_7 obj_06 obj_02)
       (pred_7 obj_02 obj_01)
       (pred_7 obj_02 obj_09)
       (pred_7 obj_02 obj_06)
       (pred_7 obj_09 obj_19)
       (pred_7 obj_09 obj_15)
       (pred_7 obj_09 obj_02)
       (pred_7 obj_15 obj_18)
       (pred_7 obj_15 obj_09)
       (pred_7 obj_05 obj_12)
       (pred_7 obj_05 obj_01)
       (pred_7 obj_05 obj_06)
       (pred_7 obj_01 obj_07)
       (pred_7 obj_01 obj_19)
       (pred_7 obj_01 obj_02)
       (pred_7 obj_01 obj_05)
       (pred_7 obj_19 obj_17)
       (pred_7 obj_19 obj_18)
       (pred_7 obj_19 obj_09)
       (pred_7 obj_19 obj_01)
       (pred_7 obj_18 obj_04)
       (pred_7 obj_18 obj_15)
       (pred_7 obj_18 obj_19)
       (pred_7 obj_12 obj_21)
       (pred_7 obj_12 obj_07)
       (pred_7 obj_12 obj_05)
       (pred_7 obj_07 obj_10)
       (pred_7 obj_07 obj_17)
       (pred_7 obj_07 obj_01)
       (pred_7 obj_07 obj_12)
       (pred_7 obj_17 obj_16)
       (pred_7 obj_17 obj_04)
       (pred_7 obj_17 obj_19)
       (pred_7 obj_17 obj_07)
       (pred_7 obj_04 obj_08)
       (pred_7 obj_04 obj_18)
       (pred_7 obj_04 obj_17)
       (pred_7 obj_21 obj_10)
       (pred_7 obj_21 obj_12)
       (pred_7 obj_10 obj_16)
       (pred_7 obj_10 obj_07)
       (pred_7 obj_10 obj_21)
       (pred_7 obj_16 obj_08)
       (pred_7 obj_16 obj_17)
       (pred_7 obj_16 obj_10)
       (pred_7 obj_08 obj_04)
       (pred_7 obj_08 obj_16)
       (pred_12 obj_12)
       (pred_12 obj_06)
       (pred_12 obj_10)
       (pred_5  obj_12 obj_11)
       (pred_5  obj_06 obj_20)
       (pred_5  obj_10 obj_11)
       (pred_8 obj_02)
       (pred_8 obj_09)
       (pred_8 obj_15)
       (pred_8 obj_05)
       (pred_8 obj_01)
       (pred_8 obj_19)
       (pred_8 obj_18)
       (pred_8 obj_07)
       (pred_8 obj_17)
       (pred_8 obj_04)
       (pred_8 obj_21)
       (pred_8 obj_16)
       (pred_8 obj_08)

       (pred_10  obj_14 obj_11)
       (pred_10  obj_13 obj_20)
       (pred_10  obj_03 obj_11)
       (pred_11 obj_14 obj_09)
       (pred_11 obj_13 obj_05)
       (pred_11 obj_03 obj_17)
       (pred_9 obj_07)
    )

    (:goal (and
       (pred_11 obj_13 obj_17)
       (pred_11 obj_03 obj_16)
    ))
(:constraints
  (always (not (pred_9 obj_19)))
)
)

; plan
1. (op_3 obj_07 obj_01)
   deleted: (pred_9 obj_07)
   added: (pred_9 obj_01)
   goals met: 0 of 2
2. (op_3 obj_01 obj_05)
   deleted: (pred_9 obj_01)
   added: (pred_9 obj_05)
   goals met: 0 of 2
3. (op_5 obj_05 obj_13)
   deleted: (pred_11 obj_13 obj_05) (pred_6)
   added: (pred_4 obj_13)
   goals met: 0 of 2
4. (op_3 obj_05 obj_01)
   deleted: (pred_9 obj_05)
   added: (pred_9 obj_01)
   goals met: 0 of 2
5. (op_3 obj_01 obj_07)
   deleted: (pred_9 obj_01)
   added: (pred_9 obj_07)
   goals met: 0 of 2
6. (op_3 obj_07 obj_17)
   deleted: (pred_9 obj_07)
   added: (pred_9 obj_17)
   goals met: 0 of 2
7. (op_2 obj_17 obj_03 obj_13)
   deleted: (pred_4 obj_13) (pred_11 obj_03 obj_17)
   added: (pred_4 obj_03) (pred_11 obj_13 obj_17)
   goals met: 1 of 2
8. (op_3 obj_17 obj_16)
   deleted: (pred_9 obj_17)
   added: (pred_9 obj_16)
   goals met: 1 of 2
9. (op_1 obj_16 obj_03)
   deleted: (pred_4 obj_03)
   added: (pred_6) (pred_11 obj_03 obj_16)
   goals met: 2 of 2
